{

  "assets" : 103,
  
  "fonts_hub" : [
    { "id" : "ARIAL16", "file" : "resources/fonts/ARIAL.ttf", "size": 16 },
    { "id" : "ARIAL24", "file" : "resources/fonts/ARIAL.ttf", "size": 24 },
    { "id" : "ARIAL48", "file" : "resources/fonts/ARIAL.ttf", "size": 48 },
    { "id" : "PTMONO24", "file" : "resources/fonts/PTMono-Regular.ttf", "size": 24 },
    { "id": "SOURCESERIF24", "file": "resources/fonts/SourceSerifPro-Regular.ttf", "size": 24}
  ],
  "images_hub": [
    {
      "id": "BlackScreen",
      "file": "resources/images/blackScreen.png"
    },
    {
      "id": "etheria",
      "file": "resources/images/Hub/etheria.png"
    },
    {
      "id": "lumine",
      "file": "resources/images/Hub/lumine.png"
    },
    {
      "id": "terria",
      "file": "resources/images/Hub/terria.png"
    },
    {
      "id": "end_open",
      "file": "resources/images/Hub/end_open.png"
    },
    {
      "id": "end_closed",
      "file": "resources/images/Hub/end_closed.png"
    },
    {
      "id": "eye_open",
      "file": "resources/images/Hub/eye_open.png"
    },
    {
      "id": "eye_closed",
      "file": "resources/images/Hub/eye_closed.png"
    },
    {
      "id": "eye_win",
      "file": "resources/images/Hub/eye_win.png"
    },
    {
      "id": "frog_open",
      "file": "resources/images/Hub/frog_open.png"
    },
    {
      "id": "frog_win",
      "file": "resources/images/Hub/frog_win.png"
    },
    {
      "id": "tree_win",
      "file": "resources/images/Hub/tree_win.png"
    },
    {
      "id": "tree_open",
      "file": "resources/images/Hub/tree_open.png"
    },
    {
      "id": "tree_closed",
      "file": "resources/images/Hub/tree_closed.png"
    },
    {
      "id": "resume",
      "file": "resources/images/MenuPausa/resumeButton.png"
    },
    {
      "id": "back",
      "file": "resources/images/MenuControles/backButton.png"
    },
    {
      "id": "keyboardControls",
      "file": "resources/images/MenuControles/Teclado.png"
    },
    {
      "id": "menu",
      "file": "resources/images/MenuPausa/menuButton.png"
    },
    {
      "id": "volume",
      "file": "resources/images/MenuPausa/audioButton.png"
    },
    {
      "id": "rightVolume",
      "file": "resources/images/MenuPausa/rightVolume.png"
    },
    {
      "id": "leftVolume",
      "file": "resources/images/MenuPausa/leftVolume.png"
    },
    {
      "id": "menuFondo",
      "file": "resources/images/MenuPrincipal/menuFondo.png"
    },
    {
      "id": "menuFondoLogo",
      "file": "resources/images/MenuPrincipal/menuFondoLogo.png"
    },
    {
      "id": "menuFondo1",
      "file": "resources/images/MenuPrincipal/menuFondo1.png"
    },
    {
      "id": "menuFondo2",
      "file": "resources/images/MenuPrincipal/menuFondo2.png"
    },
    {
      "id": "particula_menu",
      "file": "resources/images/MenuPrincipal/particula_menu.png"
    },
    {
      "id": "particula_menu2",
      "file": "resources/images/MenuPrincipal/particula_menu2.png"
    },
    {
      "id": "new_Game",
      "file": "resources/images/MenuPrincipal/newGameButton.png"
    },
    {
      "id": "continue",
      "file": "resources/images/MenuPrincipal/continueButton.png"
    },
    {
      "id": "controls",
      "file": "resources/images/MenuPrincipal/controlsButton.png"
    },
    {
      "id": "settings",
      "file": "resources/images/MenuPrincipal/settingsButton.png"
    },
    {
      "id": "quit",
      "file": "resources/images/MenuPrincipal/quitButton.png"
    },
    {
      "id": "load",
      "file": "resources/images/MenuPrincipal/loadButton.png"
    },
    {
      "id": "matt",
      "file": "resources/images/matt.png"
    },
    {
      "id": "chica",
      "file": "resources/images/topdownchicafrente.png"
    },
    {
      "id": "idle_Kyna",
      "file": "resources/images/idle_Kyna_TopDown_Spritesheet.png"
    },
    {
      "id": "walk_Kyna",
      "file": "resources/images/walk_Kyna_TopDown_Spritesheet.png"
    },
    {
      "id": "walk_side_Kyna",
      "file": "resources/images/walk_side_Kyna_TopDown_Spritesheet.png"
    },
    {
      "id": "walk_up_Kyna",
      "file": "resources/images/walk_Back_Kyna_TopDown_Spritesheet.png"
    },
    {
      "id": "heart",
      "file": "resources/images/heart.png"
    },
    {
      "id": "heartBlack",
      "file": "resources/images/heartBlack.png"
    },
    {
      "id": "healthDetail",
      "file": "resources/images/HealthDetail.png"
    },
    {
      "id": "spritesheet_hoguera",
      "file": "resources/images/spritesheet_hoguera.png"
    },
    {
      "id": "luz_naranja",
      "file": "resources/images/luz_naranja.png"
    },
    {
      "id": "letterE",
      "file": "resources/images/letterE.png"
    },
    {
      "id": "CajaDialogo",
      "file": "resources/images/CajaDialogo.png"
    }
  ],

  "musics_hub" : [
    { "id" : "musica_hub", "file" : "resources/sound/musica_hub.mp3" },
    { "id" : "music_menu", "file" : "resources/sound/music_menu.mp3" }
  ],

  "sounds_hub": [
    {
      "id": "sfx_descubrir_hub",
      "file": "resources/sound/sfx_descubrir_hub.wav"
    },
    {
      "id": "sfx_iniciar_menu",
      "file": "resources/sound/sfx_iniciar_menu.wav"
    }
  
  
  ],

    "Npcs" : [
    { "id" : "Chema_Npc", 
    "file" : "resources/images/Npcs/Chema_Npc.png" },

    { "id" : "Daniel_Npc",
    "file" : "resources/images/Npcs/Daniel_Npc.png" },

    { "id" : "Javier_Npc",
    "file" : "resources/images/Npcs/Javier_Npc.png" },

    { "id" : "Laura_Npc",
    "file" : "resources/images/Npcs/Laura_Npc.png" },

    { "id" : "Miriam_Npc",
    "file" : "resources/images/Npcs/Miriam_Npc.png" },

    { "id" : "Nacho_Npc",
    "file" : "resources/images/Npcs/Nacho_Npc.png" },

    { "id" : "Paula_Npc",
    "file" : "resources/images/Npcs/ComboBox.png" },

    { "id" : "Rodrigo_Npc",
    "file" : "resources/images/Npcs/Rodrigo_Npc.png" },

    { "id" : "Sergio_Npc",
    "file" : "resources/images/Npcs/Sergio_Npc.png" }
  ],
  
  "dialogs": [
    {
      "id": "npc1_dialogue1",
      "file": "The guardians lost their mind when the   wave of magic arrived, it had strongly   impacts on them. I remember when they    fell off screaming out loud things       completely meaningless, and then...then.. changed, they...now...no...they are...   other...thing."
    },
    {
      "id": "npc1_dialogue2",
      "file": "Is it true what they say? Have you       finished with that... thing? I cannot    believe it, how did we end up in this    situation? A frog, an enormous frog and  before...before it was the guardian Gustav"
    },
    {
      "id": "npc1_dialogue3",
      "file": "Two! You have killed two of them! That   means that Lumine is free again. When the guardian transformed himself into that   sinister tree, he started to repeat 'I am root...I am root...I am root!'"
    },
    {
      "id": "npc1_dialogue4",
      "file": "Unbelievable! You escaped without injury and nothing but Etheria in your hands.   After all, we can say that you have 'Good eye and good hands for this situations'  hahahaha, do you get it?                 Because of the guardian...the hands...the ey...it doesn't matter."
    },

    {
      "id": "npc2_dialogue1",
      "file": "We arrived at this clearing a few months ago, before the magic disappeared, before the guardians arrived. Daddy was so      afraid and told me to come here, that    essences would protect us, and the       guardians would too."
    },
    {
      "id": "npc2_dialogue2",
      "file": "That thick and ugly and unpleasant frog  scared me, and as well she made that     everything was full of  flies  that came to my food."
    },
    {
      "id": "npc2_dialogue3",
      "file": "You have ended with that stupid tree, and you took his lantern. From now on I won't be scared of looking for fireflies."
    },
    {
      "id": "npc2_dialogue4",
      "file": "The ground doesn't tremble anymore, so... you ended with that nasty monster! His   hands were enormous and they made PLOM    PLOM PLOM how did you do it?"
    },
    {
      "id": "npc3_dialogue1",
      "file": "I was an historian at the capital before the magic disappeared, before the start  of the wars for power and for control.   Before those viles mages lost their mind and before they started to kill the      remnant of the world. People think magic died because they used her in a wrong    way. Arlen knows the truth, ask her, you will find her next to the large door."
    },
    {
      "id": "npc3_dialogue2",
      "file": "The use of the magic started with the    work in the field, to make the daily     tasks more bearable, to help the people  who needed it before they found the      existence of Mextech crystals. They were materials able to accumulate the magic,  like a reserve to use later, without any limit until his consumption. Brothers    CaLeon and AleRom were the mages that    found these crystals, it's because of    them that the dark age arrived to our    world."
    },
    {
      "id": "npc3_dialogue3",
      "file": "At the start the crystals supposed  a    huge advance, a farmer could use his     magic to work in the field the whole     morning, and use the reserve the rest of the day without being exhausted even an  apex. It was incredible, unlimited magic they said, the future is in the crystals they shouted... How wrong we were. Dammed CaLeon and AleRom."
    },
    {
      "id": "npc3_dialogue4",
      "file": "No one talks about the fact that the     crystals were charged with people, using their magic to use it later, when they   needed it. No one talks about it because they learned to charge them in a darker  way, in a dirty way, kidnapping, killing, and snatching."
    },

    {
      "id": "npc4_dialogue1",
      "file": "I'm Arlen, one of the few archimages     alive in the world and yes, before you   say it, I as well participated in the    wars for power. I thought that we were   doing the right thing, that it was nice  for Arven's progress, that it would help us to be a better version of ourselves   and that the purpose would justify the   violent way of getting it. How naive,    innocent and coward I was.               Come back later I need to think."
    },
    {
      "id": "npc4_dialogue2",
      "file": "Before, when you came here to see me, I  wasn't strong enough to tell you    that you wanted to know. There are many others that won't be able to see it, pero I am, Kyna, I see   through you and I see that you are the incarnation and the  essence of our world, and if with the help of the truth I can help you in your path, I will tell you, even if it's brutal and hard to know. We, the archimages, don't live more in a natural war... we get to extend our lives with the consumption of those full of magic. You must have in consideration that the magic that     contains a young body is much superior than the magic that contains an older person, and if you     extract it through the pain it multiplies itself exponentially...I leave you this  information about how we did live for    that long."
    },
    {
      "id": "npc4_dialogue3",
      "file": "Keeping up with out conversation, we     consumed the magic that was offered to us in sacrifice voluntarily or involuntarily and with that we got more powerful, it   wasn't enough with the extraction of the magic of the world that we also stole of our compatriots, betraying the   loyalty that they deposited in us. Much of us    rebelled in light of the idea of keeping consuming magic in that way, but what    would we do? Leaving the people in hands of those that would use that magic? In   the hands of CaLeon and AleRom? Without  anyone that could fight them? But that is the thought of a coward, someone that    hadn't the courage to do the right thing."
    },
    {
      "id": "npc4_dialogue4",
      "file": "Effectively the value of the crystals    resided in an incredibly solid balance in our service every time that we needed    them to 'grow as one'. Lies, we did it   because we were selfish, thinking that   just us could guide the people in the    right way. In the beginning it was, the  most brilliant minds of the age  working as one, in an efficient way, but we were    avaricious, we weren't able to let     others keep with our job. CaLeon and     AleRon were the first ones to take the   path of destruction, but we, selfish and cynics, we condemned the world following them. It's our fault that the magic      devastation ended the world."
    },

    {
      "id": "npc5_dialogue1",
      "file": "Mages, cursed are them all and everything they have done to this world, cursed is  their magic and their dark influence.    They brought with themselves a wave of   avarice, codici and discomfort. They tell us that we made enormous progress,  that progress was a safe bet, that there      wouldn't be more poverty, hunger or lack of energie. Lots of horrors are in the   forest temple and you want to explore it? Without any protection? I don't know if  you are excessively brave or excessively sillygirl."
    },
    {
      "id": "npc5_dialogue2",
      "file": "Look at my temple, abandoned, destroyed. Before the magic and their damned reapers soul crystals, everything was done with  sweat, the strength of your hands and    honest devotion. Temples like this were   the fruit of all those efforts. The abuse of the magic and the perversion of the   crystals were the worst that happened to the world. How many talent wasted, how   many souls lost, how much death..."
    },
    {
      "id": "npc5_dialogue3",
      "file": "The horror that walks between the walls  of my temple is inquiet, maybe it notes  the rise of power, or that both of his   counterparts are dead. No matter what I  have seen, and maybe I have information  that could help you. I have seen how his fists and you would need to be careful   with them when they move, and use the    opportunity when they are quiet.         Meanwhile, his eye is always watching,   not only moving, therefore It's his      vulnerable part, when the monster gets   angry, you would have to carry to        extremes your precaution if you don't    want to get burned by the fire of his    glance."
    },
    {
      "id": "npc5_dialogue4",
      "file": "Maybe you, the incarnation  of the clean and pure magic that touched the world for the first time could be the solution to  all this chaos and disgrace that bringed the perversion of the mages, maybe with  you the world could fall apart the       crystals and bring back the soul to this fragmented world. Maybe you and just you, the magic used in a good way could bring us peace again."
    },

    {
      "id": "npc6_dialogue1",
      "file": "Well, well,well what are my eyes seeing? You, you have...  something different. I have never seen someone radiating so much energy, it looks almost as pure magic. On second thoughts, days before now, it     seems like some kind of light is         wandering through the woods, and before  you mention the obvious, no, I am not    nuts. Several nights ago I thought I saw a lantern, floating in the middle of the  woods, but now that I think about it, it looked like something was carrying it    from side to side, intriguing, isn't it?"
    },
    {
      "id": "npc6_dialogue2",
      "file": "Aye, Kyna. Do you remember that I told   you about that floating lantern in the   woods? Well, it turns out that it doesn't float at all ! It's carried by a tree ! A DAMNED TREE! I swear the lantern seems to be kinda important for this abomination, and if i have to bet, i would say that   only he could damage it. I do really     think not even that sword of you could   make a single scratch on it at first."
    },
    {
      "id": "npc6_dialogue3",
      "file": "I was right, uh? That lamp, the one the  tree was carrying around was the weak    spot, uh? The one thing that really      doesn't make sense to me is that you have to turn his attacks against himself ! Who would have thought that was the only     capable way of destroying it? It seemed  like behind this twisted logic were ten  troubled minds as a result of  their     teachers having them torn down and       consequently leading them to become some kind of psychopaths."
    },
    {
      "id": "npc6_dialogue4",
      "file": "I think I exceeded myself on that last   comment, but it was something that came  to my mind at that point. Emmm, I think I am kinda better at this point, no need   for you looking at me that way. I am not mad at all, it is just...simply...it has been a rough few days.     "
    },

    {
      "id": "npc7_dialogue1",
      "file": "I have been fishing here for more than   fifty years and haven't seen something   like that enormous frog in the swamp. It is a bloody annoying creature, as my     mother used to say. You will only have   one opportunity if you pay attention to  the flies, and the bounces. What's more, if you annoy it enough you better be fast as hell, or you will be inside its tummy without being conscious of it."
    },
    {
      "id": "npc7_dialogue2",
      "file": "I am really not sure how you have        accomplished it. I would like to think   that you have been lucky. Either way,    before this magic catastrophe took place and those damned guardians came along     everything here was peace, tranquility   and bliss. Who would have wondered       overnight about a frog to be as big as   the cow you have in the yard. Nah, the   world has become mad."
    },
    {
      "id": "npc7_dialogue3",
      "file": "I will tell you something that only a few know, youngling. In the cities, when     people died, they had to give their      crystals to the mages in their temples,  meaning that all the magic stored in them was meant to be used only by those mages, in a really selfish way. When people die here, in the woods, in towns like the    ones you can find around, both the body  and the crystals they return to the land, to the earth. Did you really think, only about a second, that it was pure         coincidence that the cities were         devastated to the ground, and woods,     towns and places far from them survived?"
    },
    {
      "id": "npc7_dialogue4",
      "file": "I think I have already seen all kinds of things Kyna, you have  truly proved that there is hope for this devastated world. I think the role that you have to perform has been a shocking one. After beating   the last of the guardians you deserve a  well earned rest. Seize the summer and   take a deep breath, who knows what is    planned for you in the near future."
    },

    {
      "id": "npc8_dialogue1",
      "file": "Hi there youngling, I am Ollin, and if I was told to define myself in a few words I would rather choose avenger, mercenary and last but not least thief. When the   mages discovered Mextech crystals I was  there, in the same excavation and you    would be properly asking yourself 'wait a second, was it not like a thousand years ago?' hahaha, take a break youngling, all should be explained with time."
    },
    {
      "id": "npc8_dialogue2",
      "file": "As well as you have killed that froggy   guardian, I have dedicated most of my    life to kill mages, surprised? You       shouldn't.  If you would ask by any      chance that priest over there, near the  entrance to the temple he might say the  same I am saying. Magic is this world's  scourge and not a single bad thing would have happened to us if it had never been discovered. It has only brought us chaos, problems, selfishness, greed and evil.   It took everything from me. My family. My home. Everything I ever loved..."
    },
    {
      "id": "npc8_dialogue3",
      "file": "As I told you before, my life started to skew the day the mages discovered the    crystals, the usefulness they had storing huge amounts of magic and what was worse, the way they could transform that        knowledge upside down to extract energy  and magic from living beings. My village was the first to be used as an experiment the people I knew were the first to be   drained. Life, essence, magic. My wife   and daughter were among them. From that  day I hunt mages, consume their magic    they expel with the last of their breaths."
    },
    {
      "id": "npc8_dialogue4",
      "file": "That filthy and devious priest seemed to have changed his opinion, didn't he?     Yeeeeeh of course. From now on everything is arranged and is working properly. We  are almost touching balance with the tips of our fingers, and you, our perfect     champion have recovered all primal       essences. From now on we must forget     thousands of years of sacrifices,        vexations and murders in daylight.We have to forget all the greed and craving power from a few filthy and hypocrite mages.   They only looked for an excuse to live   endlessly like little gods among the     people.I DO NOT FORGET !I DO NOT FORGIVE! If this is supposed to be a new paragraph in the world's history you should have   this clear in your mind, I will assure   that it is written in blood."
    },

    {
      "id": "npc9_dialogue1",
      "file": "Hi ! My name is Bosco and I have seen you wandering around the clearing, talking to people and asking about everything. You  look not much older than me and however  so different, right? I would go along    with you, showing all the interesting    things you can see and do here in the    woods, but Arlen, the mage, doesn't allow me to walk away from this clearing. She  brought me here from the city when mom   and dad went to the temple of the mages, nothing less than going to talk with     CaLeon and AleRom, the two greatest      archmages, do you think they are okay?   Arlen says that they surely are, but     starts to cry whenever we talk about them."
    },
    {
      "id": "npc9_dialogue2",
      "file": "Kyna! Hi ! It is great to go into the    swamp without being afraid of that frog, jumping around everywhere and carrying so many flies with it from side to side     hahaha you are fantastic. I really really don't like flies, they remind me of the  old districts where I had to pass through when I had to go home there in the city. I saw mages go there and take some       children with them to their temples. I am sure that those children learnt many cool things about magic, didn't they?"
    },
    {
      "id": "npc9_dialogue3",
      "file": "Hi there Kyna! Would you let me see your sword? It reminds me of the crystals my  mom and dad had. The color is the same   the crystals had when  they put magic on them. It's a beautiful color isn't it?   Arlen says that the most powerful        crystals shone with more light than the  others, does it mean that your sword is   really powerful Kyna? Do you have a lot  of magic? When I grow old I want to have as much magic as you have, and fight     monsters as you have done with that scary tree ha ha ha. Arlen says that in a      really little time we could be even      capable of entering inside the temple    over there, the priest's one! What a win!"
    },
    {
      "id": "npc9_dialogue4",
      "file": "Today Arlen has not stopped crying, do   you know what is happening to her Kyna?   She says that everything is her fault,   that she was a coward, but I don't think she is, right? She was really brave and  saved me from that purple explosion in   the city. I think she is sad because mom and dad are not here with us and I remind her of them. You should go and talk to   her,maybe she will tell you why is so sad?"
    },

    {
      "id": "npc10_dialogue1",
      "file": "Leave alone Kiddo, go bother anyone else. I had much work with all the dead corpses because of those magic dysfunctions,     there in the city and now I have to add  all the people that appear half eaten in the swamp, or impaled by roots in the    middle of the woods. Or what is worse,   the ones near the temple, those are burnt to the bones or smashed, looking like    human slurry. The world has become mad   kiddo, and I pick up the remains of the  asylum."
    },
    {
      "id": "npc10_dialogue2",
      "file": "I have seen you die several times kiddo, and appear over here again and again, not a single scratch, not a single cut. You  simply hug death and live intermittently, and what bothers me the most...I am not  surprised at all. I have lived surrounded by death for so long, and seeing you     dying time after time to appear here, in the clearing, unharmed should disturb my mind, just a little bit...and it's not   the case."
    },
    {
      "id": "npc10_dialogue3",
      "file": "You again. People are saying that there  is a little tree in the woods whose      branches are not growing back again,     whose light is brighting no more. Where  someone saw a threat and a monster I saw something unique. Don't take me for a    fool, it truly satisfied you to have     killed him, just because I don't have to bury any more impaled people, but...think about it, since you arrived there, you   have done no other thing than killing    unique creatures in this world. What     would happen if you can not collect the  primal essences? Would it be so bad for a world to exist without magic? After all, it is because of the magic that the world itself is torn down. Think about it..."
    },
    {
      "id": "npc10_dialogue4",
      "file": "Once again, the immortal kiddo over here. Once more unharmed and fresh as a lettuce none would say that you have possibly    killed three of the most rare and        powerful creatures in the world, at least the ones we know and despite that fact... You feel nothing, there is nothing inside you that feels happiness, or remorse, or sadness, nothing... You are pure magic,  that is crystal clear, but you have not  just one feeling and I feel sorry for    you. Lots of people here are happy about your performance in this story, your     success and being the one who is bringing back the magic to the world... but I am   not one of them."
    }
  ]
}
